[{"title":"What are One-time Gifts?","category":"1203","detailed_question":null,"content":"\u003Cp\u003EOne-time gifts are single, outright gifts of any amount made to any of 2,400+ funds benefiting the people, places and programs throughout the University of Colorado\u0027s four campuses. \u003Ca href=\u0022fund-search\u0022\u003EFind a fund\u0026nbsp;to start your one-time gift!\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"what-are-one-time-gifts"},{"title":"What are Recurring Gifts?","category":"1203","detailed_question":null,"content":"\u003Cp\u003EA recurring gift is a fixed amount given on a regular periodic schedule, such as monthly, quarterly or annually. This gift continues in perpetuity until the donor requests to cancel or change it.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022node\/7595\u0022\u003ESet up and manage recurring gifts\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"what-are-recurring-gifts"},{"title":"What are Payroll Deductions?","category":"1203","detailed_question":null,"content":"\u003Cp\u003EPayroll deduction is offered to CU faculty and staff as a simple and easy way for you to make a powerful statement about your commitment to CU’s future. These monthly recurring gifts are automatically deducted from your pay check each month, and can be set up, changed or cancelled at any time.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022faq#t1204n7596\u0022\u003ESet up and manage payroll deductions (for CU faculty\/staff)\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"what-are-payroll-deductions"},{"title":"What are Pledge Commitments?","category":"1203","detailed_question":null,"content":"A pledge commitment is a promise by a donor to pay a specified amount in full over a predetermined time period, usually no more than five years.","path":"what-are-pledge-commitments"},{"title":"What are Memorial and Honorary Gifts?","category":"1203","detailed_question":null,"content":"Memorial and honorary gifts recognize a loved one or someone influential to the donor. Any gift of any amount can be designated as an honorary or memorial donation.","path":"what-are-memorial-and-honorary-gifts"},{"title":"What are Matching Gifts?","category":"1203","detailed_question":null,"content":"\u003Cp\u003EMore than 15,000 companies and subsidiaries will match tax-deductible charitable contributions made by their employees, retirees and employees\u0027 spouses—which can double (or triple) the value of your gift! Matching gifts are directed to the same designation as your original gift, unless your employer dictates otherwise. The CU Foundation will recognize you for the total amount. For questions about this or other aspects of matching gifts, please call 303-541-1290 or email matching.gifts@cufund.org.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022faq#t1204n7601\u0022\u003ELearn how to take advantage of a matching gift program\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"what-are-matching-gifts"},{"title":"What are Outright Gifts?","category":"1203","detailed_question":null,"content":"\u003Cp\u003EOutright gifts make up the majority of contributions to CU, and encompass the following gift types: cash, stocks and bonds, real estate, tangible personal property, matching gifts or gifts-in-kind. In general, outright gifts qualify for an immediate income tax deduction. For questions or more detailed information, you can call 303-541-1290 or email \u003Ca href=\u0022mailto:gifts@cufund.org\u0022\u003Egifts@cufund.org\u003C\/a\u003E.\u003C\/p\u003E\r\n","path":"faq\/what-are-outright-gifts"},{"title":"What are Endowments?","category":"1203","detailed_question":null,"content":"\u003Cp\u003EEndowments are gifts that keep on giving, and serve as a reliable long-term funding source that supports a designated purpose or program at CU in perpetuity. The principal amount of an endowed fund is permanently invested by the University of Colorado Foundation in its Long Term Investment Pool (LTIP), generating interest income that is then used to fund the purpose or program designated by the donor.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022faq#t1204n7603\u0022\u003EMake a gift to an endowment\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1204n7604\u0022\u003EEstablish a new endowment\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7618\u0022\u003EHow does the CU Foundation\u0027s endowment work?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7619\u0022\u003EWho manages the CU Foundation’s endowment?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7617\u0022\u003EDo you charge a fee on gifts or endowments?\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"what-are-endowments"},{"title":"What are Planned Gifts?","category":"1203","detailed_question":null,"content":"\u003Cp\u003EA planned gift refers to a wide array of customizable giving mechanisms that may blend current and future commitments, maximize tax and estate factors, and optimize your current cash flow or finances.\u003C\/p\u003E\r\n\r\n\u003Cp\u003ECommon planned gift types include:\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003EBequests\u003C\/li\u003E\r\n\t\u003Cli\u003ECharitable gift annuities\u003C\/li\u003E\r\n\t\u003Cli\u003ECharitable remainder trusts\u003C\/li\u003E\r\n\t\u003Cli\u003ECharitable lead trusts\u003C\/li\u003E\r\n\t\u003Cli\u003EReal estate\u003C\/li\u003E\r\n\t\u003Cli\u003ERetirement accounts\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\r\n\u003Cp\u003E\u003Ca href=\u0022https:\/\/giftplanning.cu.edu\/\u0022 target=\u0022_blank\u0022\u003ELearn more at our Gift Planning\u0026nbsp;website\u003C\/a\u003E.\u003C\/p\u003E\r\n","path":"what-are-planned-gifts"},{"title":"What are Challenge Gifts?","category":"1203","detailed_question":null,"content":"A challenge gift is a great way for donors to use their gift as a means of inspiring and encouraging other donors. Typically, a donor will commit to donating some amount of money to a program or cause, with a precondition–or challenge–that all other donors must meet some goal or take some action within a certain amount of time in order for the gift to be fulfilled.\n\nCommon challenges include goals for total money raised or total number of donors,  and \u0022dollar-for-dollar\u0022 matches that effectively double or triple the impact of all donations up to a certain amount.","path":"what-are-challenge-gifts"},{"title":"What are Gifts-in-Kind?","category":"1203","detailed_question":null,"content":"\u003Cp\u003E“Gifts-in-kind” encompass donations of goods, rather than cash. Sample in-kind gifts include artwork, furniture, office equipment, medical equipment or certain professional services.\u003C\/p\u003E\r\n","path":"faq\/what-are-gifts-kind"},{"title":"What are Unrestricted Gifts?","category":"1203","detailed_question":null,"content":"\u003Cp\u003EUnrestricted gifts are those in which the donor gives CU\u0027s leadership total discretion in how the money may be spent, which maximizes their ability to respond to the ever-changing needs of the institution. The easiest way to make an unrestricted gift is to donate to one of CU\u0027s many unrestricted funds, often referred to as a \u0022Fund for Excellence,\u0022 \u0022Annual Fund\u0022 or \u0022Dean\u0027s Fund.\u0022\u003C\/p\u003E\r\n","path":"faq\/what-are-unrestricted-gifts"},{"title":"Make a gift by phone","category":"1204","detailed_question":null,"content":"\u003Cp\u003ETo make a gift over the phone using your credit card, please call the number below and a CU Foundation representative will be happy to accept and process your gift. +1 (303) 541-1290 Hours: Monday-Friday, 9am-4pm MT\u003C\/p\u003E\r\n","path":"make-gift-phone"},{"title":"Make a gift by mail","category":"1204","detailed_question":null,"content":"\u003Cp\u003ETo make a gift by mail, you will need to \u003Ca href=\u0022https:\/\/giving.cu.edu\/sites\/default\/files\/mail-in_pledgeform.pdf\u0022 target=\u0022_blank\u0022\u003Edownload and complete this form\u003C\/a\u003E, making sure to specify the fund you would like your gift to go to. Then, make out your check(s) for the donation amount payable to the University of Colorado Foundation.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EMail the form along with the check(s) to:\u003Cbr \/\u003E\r\nUniversity of Colorado Foundation\u003Cbr \/\u003E\r\nP.O. Box 17126\u003Cbr \/\u003E\r\nDenver, CO 80217-9155\u003C\/p\u003E\r\n","path":"make-gift-mail"},{"title":"Make a gift by check, eCheck or bank account","category":"1204","detailed_question":null,"content":"\u003Cp\u003EThe easiest way to make a gift online is by using our \u003Ci\u003EeCheck\u003C\/i\u003E option. By using this option, your gift payment is deducted directly from your personal checking or savings accounts. If you’d prefer, you can also mail in your check (see below) or \u003Ca href=\u0022\/wire-funds-cu-foundation\u0022\u003Ewire funds to the CU Foundation\u003C\/a\u003E.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Cb\u003EGive by eCheck:\u003C\/b\u003E\u003Cbr \/\u003E\r\nProceed through checkout, select “Bank Account” in the payment form and provide your bank account and routing information.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThis option is currently available for the following types of gifts:\u003C\/p\u003E\r\n\r\n\u003Cul\u003E\r\n\t\u003Cli\u003EOne-time gifts (\u003Ci\u003Esupport for recurring coming soon\u003C\/i\u003E)\u003C\/li\u003E\r\n\t\u003Cli\u003E$10,000 or less (\u003Ci\u003Etotal payment amount\u003C\/i\u003E)\u003C\/li\u003E\r\n\t\u003Cli\u003EDoes not include a license plate fund\u003C\/li\u003E\r\n\u003C\/ul\u003E\r\n\r\n\u003Cp\u003E\u003Ci\u003EPlease note: Gifts made via bank account (eCheck) can take 2-3 business days to appear on your bank statement and another 3-5 business days to be fully processed. If your gift is over $10,000 and you’d still prefer to pay electronically, please refer to our \u003Ca href=\u0022\/wire-funds-cu-foundation\u0022\u003Einstructions for wiring funds to the CU Foundation\u003C\/a\u003E\u003Ci\u003E.\u003C\/i\u003E\u003C\/i\u003E\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Cb\u003EGive by Mail:\u003C\/b\u003E\u003Cbr \/\u003E\r\nPlease \u003Ca href=\u0022https:\/\/giving.cu.edu\/sites\/default\/files\/mail-in_pledgeform.pdf\u0022\u003Edownload and complete this form\u003C\/a\u003E, making sure to specify the fund you would like your gift to go to. Then, make out your check(s) for the donation amount payable to the University of Colorado Foundation.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EMail the form along with the check(s) to:\u003Cbr \/\u003E\r\nUniversity of Colorado Foundation\u003Cbr \/\u003E\r\nP.O. Box 17126\u003Cbr \/\u003E\r\nDenver, CO 80217-9155\u003C\/p\u003E\r\n","path":"make-gift-check-echeck-or-bank-account"},{"title":"Make a gift by credit card","category":"1204","detailed_question":null,"content":"\u003Cp\u003EThe easiest way to make a gift by credit card is to donate online. You may also make a gift over the phone using your credit card by calling 303-541-1290 anytime Monday-Friday from 9am-4pm MT, and a CU Foundation representative will be happy to accept and process your gift.\u003C\/p\u003E\r\n","path":"make-gift-credit-card"},{"title":"Set up and manage recurring gifts","category":"1204","detailed_question":null,"content":"\u003Cdiv style=\u0022background-color: #f6f6f6; margin: 1%; width: 40%; float: right; padding: 1em;\u0022\u003E\r\n\u003Cp\u003E\u003Cstrong\u003ECU Faculty \u0026amp; Staff:\u003C\/strong\u003E Take advantage of our simple \u003Ca href=\u0022\/node\/7479\u0022\u003EPayroll Deduction\u003C\/a\u003E option!\u003C\/p\u003E\r\n\u003C\/div\u003E\r\n\r\n\u003Cp\u003EWhen giving online, choose the fund you\u0027d like to give to, enter your gift amount, and then check the box next to “Make this\u0026nbsp;a recurring gift.” You will then have the option to set how often you wish your gift to recur: Monthly, Quarterly or Annually.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EPlease note that the recurring gift option applies to all gifts in your Gift Basket, and cannot be set up on a fund-by-fund basis within a single donation. To make a separate one-time gift, or one with a different recurring schedule, you will need to complete them separately.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Cimg alt=\u0022recurring-gift-setup.png\u0022 src=\u0022\/sites\/default\/files\/recurring-gift-setup.png\u0022 style=\u0022height:269px; width:300px\u0022 \/\u003E\u003C\/p\u003E\r\n\r\n\u003Cp\u003EYou can also set up a recurring gift over the phone by calling us at 303-541-1290. Recurring gifts continue in perpetuity until you request to cancel or change them. To cancel or change a recurring gift, please email \u003Ca href=\u0022mailto:gifts@cufund.org\u0022\u003Egifts@cufund.org\u003C\/a\u003E or call 303-541-1290.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022faq#t1203n7580\u0022\u003EWhat are Recurring Gifts?\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"set-and-manage-recurring-gifts"},{"title":"Set up and manage payroll deductions (for CU faculty\/staff)","category":"1204","detailed_question":null,"content":"\u003Cp\u003ECU faculty and staff can set up a recurring monthly gift through an automatic payroll deduction using our \u003Cstrong\u003E\u003Ca href=\u0022https:\/\/giving.cu.edu\/payroll-deduction-form\u0022\u003Eonline Payroll Deduction form\u003C\/a\u003E\u003C\/strong\u003E. You can also use this form to change or cancel an existing payroll deduction. Please contact Gift Management at \u003Ca href=\u0022mailto:payroll.deductions@cufund.org\u0022\u003Epayroll.deductions@cufund.org\u003C\/a\u003E with gift related payroll deduction questions.\u0026nbsp; For questions about your monthly deduction please contact CU Employee Services at \u003Ca href=\u0022mailto:hcm_community@cu.edu\u0022\u003Ehcm_community@cu.edu\u003C\/a\u003E.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022faq#t1203n7581\u0022\u003EWhat are Payroll Deductions?\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"faq\/set-and-manage-payroll-deductions-cu-facultystaff"},{"title":"Fulfill a telephone pledge","category":"1204","detailed_question":null,"content":"\u003Cp\u003EIf you received a call from one of our students and pledged to make a gift to one or more funds, you can fulfill your pledge online by finding the fund(s), entering your pledge amount and then checking the box next to \u0022This is a pledge payment.\u0022 This will help us connect your gift to your pledge commitment.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EYou can also fulfill your pledge commitment, or make changes to it, by calling us at 303-541-1290.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Cimg alt=\u0022pledgepaymentfaq-checkbox.png\u0022 src=\u0022\/sites\/default\/files\/pledgepaymentfaq-checkbox.png\u0022 style=\u0022height:267px; width:250px\u0022 \/\u003E\u003C\/p\u003E\r\n","path":"fulfill-telephone-pledge"},{"title":"Make a pledge payment","category":"1204","detailed_question":null,"content":"\u003Cp\u003EIf you have established a multi-payment pledge commitment with regularly scheduled payments, you can fulfill your payments online by finding the fund (entering your pledge amount and then checking the box next to \u0022This is a pledge payment.\u0022 This will help us connect your gift to your pledge commitment. You can also fulfill your pledge payments, or make changes to it, by calling us at 303-541-1290.\u003C\/p\u003E\r\n","path":"make-pledge-payment"},{"title":"Designate a gift in honor or in memory of someone","category":"1204","detailed_question":null,"content":"Any gift—whether a one-time, recurring or a pledge—can be designated as an honorary or memorial donation. To do so online, find the fund you wish to give to and then select \u0022Yes\u0022 under \u0022Is this gift in memory or in honor of someone?\u0022 Then, select whether it is \u0022In honor of\u0022 or \u0022In memory of\u0022 and fill out the requested information.\n\nWhile we only require you to enter Honoree\u0027s name, you may also provide us with the additional information and we will reach out and notify the honoree, next of kin or contact of your gift.\n\nYou may also designate your gift when donating by phone or by mail.","path":"designate-gift-honor-or-memory-someone"},{"title":"Designate a gift for a particular purpose","category":"1204","detailed_question":null,"content":"A donor may designate a gift to a particular campus, college or school, department or even to a particular fund supporting a specific CU initiative.\n\nIf you cannot find a suitable fund on our website, can\u0027t find the fund you are looking for or just don\u0027t know the name of the fund, you can use our Write-In option. Simply go to our \u0022Write-In Fund\u0022 page, select the amount you wish to give along with any additional options, and either add it to your Gift Basket or Give Now to complete your gift. When you are ready to complete your gift, use the \u0022Comments\u0022 box at the bottom of the final checkout form to provide us with details on how you would like to designate that gift. If we have any questions, we\u0027ll contact you to ensure we have it right before process your gift.\n\nYou may also specify a particular designation for your gift when donating by phone or by mail.","path":"designate-gift-particular-purpose"},{"title":"Take advantage of a matching gift program","category":"1204","detailed_question":null,"content":"\u003Cp\u003ETo find out if your employer (or your spouse’s employer) is one of 15,000 companies and subsidiaries that matches gifts, \u003Cstrong\u003E\u003Ca href=\u0022https:\/\/www.matchinggifts.com\/cufund_iframe\/\u0022 onclick=\u0022window.open(this.href, \u0027CompanySearchTool\u0027, \u0027resizable=yes,status=no,location=no,toolbar=no,menubar=no,fullscreen=no,scrollbars=yes,dependent=no,width=300,height=600\u0027); return false;\u0022\u003Eclick here to use our\u0026nbsp;search tool\u003C\/a\u003E\u003C\/strong\u003E. If you do not find your employer here, please contact your employee benefits department for more information about their matching gift program.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EIf your company has a matching gift policy, request a matching gift form from that employer and submit your completed and signed claim\u0026nbsp;to:\u003C\/p\u003E\r\n\r\n\u003Cp\u003EUniversity of Colorado Foundation\u003Cbr \/\u003E\r\nP.O. Box 17126\u003Cbr \/\u003E\r\nDenver, CO 80217-9155\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThe University of Colorado Foundation\u0027s Tax ID # is: 84-6049811\u003C\/p\u003E\r\n\r\n\u003Cp\u003EMatching gifts are directed to the same designation as your original gift, unless your employer dictates otherwise. Call 303-541-1290 or email matching.gifts@cufund.org with questions.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022faq#t1203n7584\u0022\u003EWhat are matching gifts?\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"take-advantage-matching-gift-program"},{"title":"Obtain a CU License Plate","category":"1204","detailed_question":null,"content":"\u003Cp\u003EFor a modest donation, you can support your campus’s Alumni Association and obtain a state of Colorado license plate promoting your pride for CU Anschutz, CU Boulder, CU Denver or UCCS.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EStart Here\u003C\/strong\u003E\u003Cbr \/\u003E\r\n\u003Ca href=\u0022node\/3390\u0022\u003ECU Boulder\u003C\/a\u003E\u003Cbr \/\u003E\r\n\u003Ca href=\u0022node\/7498\u0022\u003ECU Anschutz\u003C\/a\u003E\u003Cbr \/\u003E\r\n\u003Ca href=\u0022node\/7484\u0022\u003ECU Denver\u003C\/a\u003E\u003Cbr \/\u003E\r\n\u003Ca href=\u0022http:\/\/www.uccs.edu\/new\/alumni\/plates.html\u0022 target=\u0022_blank\u0022\u003EUCCS\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"obtain-cu-license-plate"},{"title":"Make a gift to an endowment","category":"1204","detailed_question":null,"content":"\u003Cp\u003EContribute to an existing endowment in support of CU by selecting one from our list of endowed funds. Click here to see a list of endowed funds you can give to today, or select \u0022Endowed Funds\u0022 from the Fund Type dropdown when \u003Ca href=\u0022fund-search\u0022\u003Esearching for funds online\u003C\/a\u003E.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022faq#t1203n7586\u0022\u003EWhat are Endowments?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1204n7604\u0022\u003EEstablish a new endowment\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7618\u0022\u003EHow does the CU Foundation\u0027s endowment work?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7619\u0022\u003EWho manages the CU Foundation’s endowment?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7617\u0022\u003EDo you charge a fee on gifts or endowments?\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"make-gift-endowment"},{"title":"Establish a new endowment","category":"1204","detailed_question":null,"content":"\u003Cp\u003ENew endowments can be established generally at a minimum level of $25,000, fundable with a gift or commitment payable over up to five years. Certain CU campuses and programmatic categories may have different endowment minimums.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EIf you are interested in creating a new endowment or have questions about endowment minimums, please contact us at giftadministration@cu.edu or 303-541-1252 and we will connect you with a development professional in the academic unit you aim to support.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Ca href=\u0022https:\/\/giving.cu.edu\/sites\/default\/files\/university-of-colorado-guide-to-endowments.pdf\u0022 target=\u0022_blank\u0022\u003EClick here to see our Guide to Endowments\u003C\/a\u003E and learn more about the specifics of CU\u0027s endowment.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022faq#t1203n7586\u0022\u003EWhat are Endowments?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1204n7603\u0022\u003EMake a gift to an endowment\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7618\u0022\u003EHow does the CU Foundation\u0027s endowment work?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7619\u0022\u003EWho manages the CU Foundation’s endowment?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7617\u0022\u003EDo you charge a fee on gifts or endowments?\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"establish-new-endowment"},{"title":"Give stocks, bonds, mutual funds and other financial assets","category":"1204","detailed_question":null,"content":"\u003Cp\u003E\u003Ca href=\u0022https:\/\/forms.monday.com\/forms\/17b7c115ab53762efcefab3febb56f98?r=use1\u0022 target=\u0022_blank\u0022\u003EClick here to complete our intake form for new stock, securities or cash gifts\u003C\/a\u003E. Further details and instructions will be sent to you upon submitting the form.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EContact CU Foundation Gift Management at \u003Ca href=\u0022mailto:gifts@cufund.org\u0022\u003Egifts@cufund.org\u003C\/a\u003E or \u003Ca href=\u0022tel:303-541-1290\u0022\u003E303-541-1290\u003C\/a\u003E with questions. Please consult your advisors for tax and legal advice.\u003C\/p\u003E\r\n","path":"faq\/give-stocks-bonds-mutual-funds-and-other-financial-assets"},{"title":"Give real estate or other personal property","category":"1204","detailed_question":null,"content":"\u003Cp\u003E\u003Ca href=\u0022https:\/\/giftplanning.cu.edu\/contact-us\u0022 target=\u0022_blank\u0022\u003EContact our Gift Planning Team\u003C\/a\u003E for guidance on these individual circumstances.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Cstrong\u003EPlease note: \u003C\/strong\u003EIn-kind gifts of personal property are now processed by the Gift Planning Team. For guidance on in-kind gifts, contact the CU System Advancement Office at \u003Ca href=\u0022mailto:GIK@cu.edu\u0022\u003EGIK@cu.edu\u003C\/a\u003E or 303-541-1229.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Ca href=\u0022https:\/\/giftplanning.cu.edu\/\u0022 target=\u0022_blank\u0022\u003ELearn more at our Gift Planning website\u003C\/a\u003E.\u003C\/p\u003E\r\n","path":"give-real-estate-or-other-personal-property"},{"title":"Get help making a gift","category":"1204","detailed_question":null,"content":"\u003Cp\u003EFor assistance with making a gift online, please email giving@cu.edu or call 303-541-1258. For all other gift-related inquiries, call 303-541-1290 or email \u003Ca href=\u0022mailto:gifts@cufund.org\u0022\u003Egifts@cufund.org\u003C\/a\u003E or visit our Contact Us page to find the best contact to address your needs.\u003C\/p\u003E\r\n","path":"faq\/get-help-making-gift"},{"title":"If CU is a public university, why are private gifts needed?","category":"1205","detailed_question":null,"content":"The state of Colorado provides less than 6 percent of the university’s $3.5 billion operating budget, down from more than 25 percent in 1990. Private support—which, in 2015, comprised a larger share of CU’s budget than funding received from the state of Colorado—is an important and increasingly fundamental component of CU’s budget. And targeted donor support for strategic priorities allows the university to attract and retain the best and brightest faculty, provide scholarships, build first-class facilities and direct education and research toward filling community needs and solving societal problems.","path":"if-cu-public-university-why-are-private-gifts-needed"},{"title":"Is my gift tax-deductible?","category":"1205","detailed_question":null,"content":"The CU Foundation is a 501(c)(3) charitable organization. All gifts to the Foundation are tax-deductible to the fullest extent of the law, but circumstances vary depending on each donor’s individual financial situation. You should consult with your tax attorney\/advisor concerning the deductibility of your gift.","path":"my-gift-tax-deductible"},{"title":"What is the CU Foundation’s tax ID number?","category":"1205","detailed_question":null,"content":"CU Foundation Tax ID: 84-6049811","path":"what-cu-foundation’s-tax-id-number"},{"title":"Will I receive a receipt?","category":"1205","detailed_question":null,"content":"Yes. Gift tax receipts are typically issued within 2 business days, and can be delivered via email or mail.","path":"will-i-receive-receipt"},{"title":"How quickly will my gift be processed?","category":"1205","detailed_question":null,"content":"\u003Cp\u003EWe aim to process all donations and issue gift tax receipts within 2 business days of when they are made.\u003C\/p\u003E\r\n","path":"how-quickly-will-my-gift-be-processed"},{"title":"How can I be sure gifts go to their intended purpose?","category":"1205","detailed_question":null,"content":"Gift funds and gift agreements are contractual documents, and our policies and practices are oriented toward ensuring that the donor’s intent is honored. CU Advancement staff work closely with faculty partners to maximize the impact of donor support on CU programs.\n\nDonors who establish endowments receive periodic Endowment Status Reports that update these donors on investment performance and fund balances. We provide an Annual Report and other communications in an effort to be transparent to donors and the community.","path":"how-can-i-be-sure-gifts-go-their-intended-purpose"},{"title":"How do I update my information?","category":"1205","detailed_question":null,"content":"\u003Cp\u003EDo we have wrong or out-of-date information for you? Please let us know! You can update your record by \u003Ca href=\u0022update-my-records\u0022\u003Eusing our online form\u003C\/a\u003E, or by calling us at 303-541-1290.\u003C\/p\u003E\r\n","path":"how-do-i-update-my-information"},{"title":"How do I contact CU Advancement or the CU Foundation?","category":"1205","detailed_question":null,"content":"\u003Cp\u003EFor any gift-related inquiries, call 303-541-1290 or email \u003Ca href=\u0022mailto:gifts@cufund.org\u0022\u003Egifts@cufund.org\u003C\/a\u003E. For other inquiries, visit our \u003Ca href=\u0022node\/7413\u0022\u003EContact Us page\u003C\/a\u003E to find the best contact according to your needs.\u003C\/p\u003E\r\n","path":"how-do-i-contact-cu-advancement-or-cu-foundation"},{"title":"Who governs the CU Foundation?","category":"1205","detailed_question":null,"content":"A volunteer Board of Directors has fiduciary oversight, elects the officers of the Foundation and appoints the chief executive officer. The CU president, a representative of the university’s Board of Regents, and another university designee serve as non-voting members of the Foundation’s Board of Directors.","path":"who-governs-cu-foundation"},{"title":"Do you charge a fee on gifts or endowments?","category":"1205","detailed_question":null,"content":"\u003Cp\u003EThe CU Foundation does not charge fees on current gifts or pledge commitments; those gifts entirely support the program designated by the donor. As is common practice among university endowments, the CU Foundation collects an assessment of 1.5% on all endowments to support the University of Colorado’s Advancement operations.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022https:\/\/giving.cu.edu\/faq#t1203n7586\u0022\u003EWhat are Endowments?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1204n7603\u0022\u003EMake a gift to an endowment\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1204n7604\u0022\u003EEstablish a new endowment\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7618\u0022\u003EHow does the CU Foundation\u0027s endowment work?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7619\u0022\u003EWho manages the CU Foundation’s endowment?\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"do-you-charge-fee-gifts-or-endowments"},{"title":"How does the CU Foundation\u0027s endowment work?","category":"1205","detailed_question":null,"content":"\u003Cp\u003EThe CU Foundation manages more than 2,700 individual endowments that generate an ongoing source of support for an individual university priority (such as scholarships, research, or faculty support) specified by that endowment donor. These 2,700-plus endowments are invested collectively in a long term investment pool (LTIP).\u003C\/p\u003E\r\n\r\n\u003Cp\u003EAn endowment typically needs to be funded at a minimum level of at least $25,000 (though minimums may vary by campus or programmatic category) in order to actively support the specified CU program. Once that occurs, the endowment distributes 4% of its average fair market value each year to the specified CU program.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Ca href=\u0022https:\/\/giving.cu.edu\/sites\/default\/files\/university-of-colorado-guide-to-endowments.pdf\u0022 target=\u0022_blank\u0022\u003EClick here to learn more about the specifics of CU\u0027s endowment.\u003C\/a\u003E\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022faq#t1203n7586\u0022\u003EWhat are Endowments?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1204n7603\u0022\u003EMake a gift to an endowment\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1204n7604\u0022\u003EEstablish a new endowment\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7619\u0022\u003EWho manages the CU Foundation’s endowment?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7617\u0022\u003EDo you charge a fee on gifts or endowments?\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"how-does-cu-foundations-endowment-work"},{"title":"Who manages the CU Foundation’s endowment?","category":"1205","detailed_question":null,"content":"\u003Cp\u003EThe CU Foundation’s volunteer Investment Policy Committee provides fiduciary oversight and determines investment policy. Currently, Perella Weinberg Partners manages the portfolio on a day-to-day basis, according to the policies and asset-allocation guidelines set by the Investment Policy Committee.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E• \u003Ca href=\u0022faq#t1203n7586\u0022\u003EWhat are Endowments?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1204n7603\u0022\u003EMake a gift to an endowment\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1204n7604\u0022\u003EEstablish a new endowment\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7618\u0022\u003EHow does the CU Foundation\u0027s endowment work?\u003C\/a\u003E\u003Cbr \/\u003E\r\n• \u003Ca href=\u0022faq#t1205n7617\u0022\u003EDo you charge a fee on gifts or endowments?\u003C\/a\u003E\u003C\/p\u003E\r\n","path":"who-manages-cu-foundation’s-endowment"},{"title":"Does the CU Foundation make grants?","category":"1205","detailed_question":null,"content":"The Foundation’s mission is limited to supporting the University of Colorado. Therefore, the Foundation does not make grants to external organizations or individuals.","path":"does-cu-foundation-make-grants"},{"title":"How are CU’s fundraising priorities determined?","category":"1205","detailed_question":null,"content":"CU’s campus leadership determine which proposed initiatives and projects become fundraising priorities in consultation with the university president and the Board of Regents. Strategies are then developed to seek funding for the priorities.","path":"how-are-cu’s-fundraising-priorities-determined"},{"title":"Make your end-of-year gift","category":"1204","detailed_question":null,"content":"\u003Cp\u003EMaking a gift at the end of the year is a great way to support the University of Colorado and potentially take advantage of any tax benefits you may qualify for this year. \u003Ca href=\u0022\/node\/7640\u0022\u003EClick here\u003C\/a\u003E to see information and suggestions about how to make your gift before year-end.\u003C\/p\u003E\r\n","path":"make-your-end-year-gift"},{"title":"Wire funds to the CU Foundation","category":"1204","detailed_question":null,"content":"\u003Cp\u003E\u003Ca href=\u0022https:\/\/forms.monday.com\/forms\/17b7c115ab53762efcefab3febb56f98?r=use1\u0022 target=\u0022_blank\u0022\u003EClick here to complete our intake form for new stock, securities or cash gifts\u003C\/a\u003E. Further details and instructions will be sent to you upon submitting the form.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EContact CU Foundation Gift Management at \u003Ca href=\u0022mailto:gifts@cufund.org\u0022\u003Egifts@cufund.org\u003C\/a\u003E or \u003Ca href=\u0022tel:303-541-1290\u0022\u003E303-541-1290\u003C\/a\u003E with questions. Please consult your advisors for tax and legal advice.\u003C\/p\u003E","path":"wire-funds-cu-foundation"},{"title":"What are the tax incentives offered by the new CARES (Coronavirus Aid, Relief, and Economic Security) Act?","category":"1205","detailed_question":null,"content":"\u003Cp\u003EThe CARES (Coronavirus Aid, Relief, and Economic Security) Act is designed to help you, businesses and nonprofits during the global coronavirus pandemic. The CARES Act allows taxpayers who take the standard deduction to make up to $300 of charitable contributions to qualified charities such as the University of Colorado through Dec. 31, 2020. For those who do itemize their deductions, the new law allows for cash contributions to CU to be deducted up to 100% of your adjusted gross income; it also temporarily suspends the requirements for required minimum distributions (RMD) for IRA owners.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u003Ca href=\u0022https:\/\/giftplanning.cu.edu\/cares-act\u0022 target=\u0022_blank\u0022\u003EClick here for more information\u003C\/a\u003E, including a brief webinar about how the CARES Act may affect you and your charitable goals.\u003C\/p\u003E\r\n","path":"what-are-tax-incentives-offered-new-cares-act"}]